数据分析中绝大多数都是在和DataFrame打交道

In [ ]:
import pandas as pd

In [8]:
name=pd.Series(["小城","小李","小张","小汪","小找","小轴"],index=["001","002","003","004","005","006"])
gender=pd.Series(["女","女","男","男","女","男"],
                index=["006","005","004","003","002","001"])
height=pd.Series([172.5,168.0,178.2,181.3,161.7],
                index=["001","002","003","004","005"])
students=pd.DataFrame({"姓名":name,"性别":gender,"身高":height})
students

     姓名 性别     身高
001  小城  男  172.5
002  小李  女  168.0
003  小张  男  178.2
004  小汪  男  181.3
005  小找  女  161.7
006  小轴  女    NaN

In [9]:
students.index

Index(['001', '002', '003', '004', '005', '006'], dtype='object')

In [10]:
students.columns

Index(['姓名', '性别', '身高'], dtype='object')

In [11]:
students.T

      001    002    003    004    005  006
姓名     小城     小李     小张     小汪     小找   小轴
性别      男      女      男      男      女    女
身高  172.5  168.0  178.2  181.3  161.7  NaN

In [12]:
students.身高

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

In [18]:
students[["性别","身高"]]

    性别     身高
001  男  172.5
002  女  168.0
003  男  178.2
004  男  181.3
005  女  161.7
006  女    NaN

In [16]:
students.loc["003"]

姓名       小张
性别        男
身高    178.2
Name: 003, dtype: object

In [19]:
students.loc["003":"005"]

     姓名 性别     身高
003  小张  男  178.2
004  小汪  男  181.3
005  小找  女  161.7

In [20]:
students.loc["005","身高"]

161.7

In [21]:
students.loc[["003","005"],["姓名","身高"]]

     姓名     身高
003  小张  178.2
005  小找  161.7

In [22]:
students.loc[["003","005"],:]

     姓名 性别     身高
003  小张  男  178.2
005  小找  女  161.7

In [23]:
students[(students.身高>165) & (students.性别=="女")]

     姓名 性别     身高
002  小李  女  168.0

In [25]:
students.head(2)

     姓名 性别     身高
001  小城  男  172.5
002  小李  女  168.0

In [26]:
students.head()

     姓名 性别     身高
001  小城  男  172.5
002  小李  女  168.0
003  小张  男  178.2
004  小汪  男  181.3
005  小找  女  161.7